In [1]:
import pandas as pd
import pyodbc

In [5]:
#Credentials
server = 'localhost,1433' 
database = 'AdventureWorksDW2017' 
username = 'sa'
password = '@PassW0rd'

In [9]:
#Connection
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=' + server+';DATABASE='+database+';UID='+username+';PWD=' + password)
cursor = cnxn.cursor()

In [11]:
# Test first 10 rows
cursor.execute("SELECT top 10 * FROM DimGeography")
for row in cursor.fetchall():
    print(row)

(1, 'Alexandria', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2015', 9, '198.51.100.2')
(2, 'Coffs Harbour', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2450', 9, '198.51.100.3')
(3, 'Darlinghurst', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2010', 9, '198.51.100.4')
(4, 'Goulburn', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2580', 9, '198.51.100.5')
(5, 'Lane Cove', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '1597', 9, '198.51.100.6')
(6, 'Lavender Bay', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2060', 9, '198.51.100.7')
(7, 'Malabar', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2036', 9, '198.51.100.8')
(8, 'Matraville', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2036', 9, '198.51.100.9')
(9, 'Milsons Point', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2061', 9, '198.51.100.10')
(10, 'Newcastle', 'NSW', 'New South Wales', 'AU', 'Australia', 'Australia', 'Australie', '2300', 9, '198.51.100.11')

In [17]:
#Create table in SQL Server
cursor.execute("IF OBJECT_ID('dbo.Sales', 'U') IS NULL \
CREATE TABLE [dbo].[Sales](\
   [Region] [varchar](50) ,\
   [Country] [varchar](50) ,\
   [ItemType] [varchar](50) NULL,\
   [SalesChannel] [varchar](50) NULL,\
   [OrderPriority] [varchar](50) NULL,\
   [OrderDate]  datetime,\
   [OrderID] bigint NULL,\
   [ShipDate] datetime,\
   [UnitsSold]  float,\
   [UnitPrice] float,\
   [UnitCost] float,\
   [TotalRevenue] float,\
   [TotalCost]  float,\
   [TotalProfit] float\
)")
cnxn.commit()

In [19]:
#Bulk Insert to the new table
cursor.execute("BULK INSERT Sales \
FROM '/home/1500000_Sales_Records.csv' \
WITH (FIRSTROW = 2,\
      FIELDTERMINATOR = ',',\
      ROWTERMINATOR = '\n',\
      BATCHSIZE = 250000\
);")
cnxn.commit()

In [20]:
#Send query to Pandas
sql_query = "SELECT top 100 * FROM [dbo].[Sales]"
data = pd.read_sql(sql_query,cnxn)

In [21]:
data.head()

,Region,Country,ItemType,SalesChannel,OrderPriority,OrderDate,OrderID,ShipDate,UnitsSold,UnitPrice,UnitCost,TotalRevenue,TotalCost,TotalProfit
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,2012-07-27,443368995,2012-07-28,1593.0,9.33,6.92,14862.69,11023.56,3839.13
1,Middle East and North Africa,Morocco,Clothes,Online,M,2013-09-14,667593514,2013-10-19,4611.0,109.28,35.84,503890.08,165258.24,338631.84
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,2015-05-15,940995585,2015-06-04,360.0,421.89,364.69,151880.40,131288.40,20592.00
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,2017-05-17,880811536,2017-07-02,562.0,109.28,35.84,61415.36,20142.08,41273.28
4,Europe,Slovakia,Beverages,Offline,L,2016-10-26,174590194,2016-12-04,3973.0,47.45,31.79,188518.85,126301.67,62217.18